<template>
	<q-page class="flex flex-center">
		<section class="IndexMain shadow-12">
			<div class="IndexMain__bl"/>

			<q-img 
				class="IndexMain__bg"
				src="assets/bjnj9n-1200x675.png"/>

			<img 
				class="IndexMain__main"
				src="assets/F7ZEadDb174.png"/>
		</section>

		<index-section v-scroll-reveal.reset>
			<p>
				Восток - неисчерпаемый кладезь неповторимых многовековых традиций. Европа всегда с особым интересом относилась к образу жизни восточных стран. Даже приоткрыв ширму таинственности, Восток всегда оставляет место загадке и сказке. На миг прикоснуться к его тайнам можно, испробовав традиционный кальян, – непременный атрибут восточной культуры. Интернет-магазин кальянов поможет вам открыть для себя новые стороны необычного мира. 
			</p>
		</index-section>

		<index-section
			class="IndexInverted shadow-12 BlackIt"
			title="КРАТКАЯ ИСТОРИЯ КАЛЬЯНА">
			<q-img 
				src="assets/06P2cTYTpYo.jpg"
				class="IndexInverted__img"/>

			<p>
				Существует мнение, что кальян появился в Египте, но на самом деле первоначальная традиция курения трубки зародилась в Индии. Страна ароматов и приправ стала родиной кальяна, а в арабские страны его привезли любопытные торговцы. Именно в Турции кальян приобрел вид, к которому сейчас привыкли европейцы. Искусные ремесленники могли изготовить его из благородных металлов или хрусталя. 
			</p>
		
			<p>
				Сегодня купить кальян в Москве можно из более практичного материала, но вкусовые качества все равно сохранятся. Традиция курения кальяна в восточных странах «доросла» до значимости чайных церемоний. После распространения табачной культуры кальян начал терять позиции. Но сегодня наблюдается возрождение интереса к древней традиции, которая «дышит» философией жизни. 
			</p>
		</index-section>

		<index-section
			v-scroll-reveal.reset
			title="КАКОЙ КАЛЬЯН ВЫБРАТЬ?"
			img="assets/QZps0a4Wj8o.jpg"
			right>

			<p>
				Магазин кальянов – это своеобразная лавка, в которой можно растеряться из-за разнообразия продукции. Поэтому к выбору изделия следует отнестись со всей серьезностью, ведь, как говорится, «Восток – дело тонкое». Прежде всего, следует определиться с размером: 
				<ul>
					<li>кальяны до 30 см чаще приобретают в декоративных целях. Интересный дизайн станет достойным дополнением к интерьеру; </li>
					<li>кальяны 40-50 см в высоту идеальны для курения в одиночку. Также его удобно носить с собой; </li>
					<li>кальяны 70-120 см предназначены для компании. Такое приобретение поможет создать особую атмосферу в кругу друзей. </li>
				</ul>
				Вы без проблем сможете подходящий кальян купить в интернет-магазине «Hooka Lend», который удивит вас ассортиментом. 
			</p>

			<p>
				Что касается табака, современная индустрия предлагает широкий выбор ароматов, с которыми можно неустанно экспериментировать. Определились с выбором – смело отправляйтесь в кальян-магазин и удивите друзей на ближайшей вечеринке. 
			</p>
			
		</index-section>

		<index-section
			class="IndexInverted shadow-12"
			title="КУРЕНИЯ КАЛЬЯНА: В ЧЕМ СЕКРЕТ?">

			<q-img 
				src="assets/kalyan.png" 
				class="IndexInverted__img"/>

			<p>
				Процесс курения – это настоящая церемония, которая требует соответственного настроения и атмосферы. Купить кальян - это только начало. Нужно создать спокойную, легкую, гармоничную обстановку, добавить несколько штрихов приятной музыки, немного вина и неспешных разговоров.
			</p>

			<p>
				Курения кальяна требует определенной подготовки. Подберите табак, аромат которого будет соответствовать вашим вкусам. После разжигания кальяна вдыхайте дым постепенно, не торопясь. Если вы решили кальяны купить для большой компании, убедитесь, что все приглашенные готовы не просто «дымить», а наслаждаться богатством аромата. 
			</p>

		</index-section>

		<index-section
			v-scroll-reveal.reset
			title="СБОРКА КАЛЬЯНА"
			img="assets/image.png"
			right>

			<p>Посещая магазин кальянов в Москве, расспросите у специалистов о сборке прибора, ведь на самом деле это очень важно. Если сложить его негерметично, ожидания от курения не оправдают себя. Детальные инструкции о том, как собрать кальян, интернет-магазин с радостью предоставляет покупателям. Основные шаги следующие. </p>

			<p>
				<ol>
				<li>Налить в колбу жидкость (воду, сок, вино, молоко). </li>
				<li>Сложить детали кальяна максимально герметично. </li>
				<li>Уложить в чашку табак специальными щипцами. Чтобы воздух лучше просачивался, сделайте прутиком отверстие в горке табака. </li>
				<li>Накрыть чашку фольгой. Иглой сделайте дырки по всей поверхности фольги. Можно использовать сетку для угля. </li>
				<li>Разжечь уголь. Посетив магазин кальянов, интернет-страницы с советами по курению кальяна, можно запутаться в том, какой уголь лучше. Специалисты рекомендуют использовать все-таки кокосовый. </li>
				<li>Накрыть чашку специальной крышкой. О готовности кальяна скажет заполненная дымом колба. Для этого нужно сделать 3-5 затяжек. </li>
			</ol>
			</p>

		</index-section>

		<index-section
			v-scroll-reveal.reset
			title="ГДЕ ПРИОБРЕСТИ ХОРОШИЙ КАЛЬЯН?"
			img="assets/1496491401_is-hookah-bad-1.png">

			<p>Качественный кальян – прежде всего, признак тонкого вкуса. Ведь это не только прибор для необычного курения, но и предмет интерьера. Сегодня существует множество магазинов, где купить кальян в Москве можно просто и быстро. Очень важно выбрать  
	предложение, в котором присутствует гармония цены и качества. </p>

			<p>
				Интернет-магазин «Hooka Lend» – это несомненный помощник в выборе. Мы предлагаем: 
				<ul>
					<li>широкий ассортимент кальянов; </li>
					<li>набор традиционных и экзотических табаков; </li>
					<li>оригинальные аксессуары для курения. </li>
				</ul>
				
				Разнообразие цен позволяет каждому клиенту выбрать кальян по вкусу и карману. Если вы еще не решились, где купить кальян, можете связаться с нашими специалистами для уточнения всех вопросов. 
			</p>

			<p>Прикоснитесь к дымке таинственности и легкой магии с магазином «Hooka Lend» – станьте ближе к древней философии Востока!</p>

		</index-section>
	</q-page>
</template>

<style>
</style>

<script>
import IndexSection from 'components/IndexSection'

export default {
	name: 'PageIndex',
	components: {
		IndexSection
	}
}
</script>

<style lang="stylus" scoped>
h3
	text-align center
	color rgb(17, 17, 17)
	font-size 26px
p
	max-width 700px
	margin 5px auto
	color rgb(85, 85, 85)
	text-align justify
	text-indent 20px

section
	width 100%
</style>

<style lang="stylus">
.IndexInverted
	position relative
	padding 50px 20px
	margin-top 50px
	
	
	p
	&
		color #eee

	&__img
		position absolute
		top 0
		right 0
		left 0
		bottom 0
		z-index -1

.BlackIt
	background rgba(0, 0, 0, .5)

.IndexMain
	position relative
	display grid
	justify-content center

	&__bl
	&__bg
		position absolute
		top 0
		right 0
		left 0
		bottom 0
		z-index -2

	&__bl
		z-index -1
		background rgba(255, 255, 255, .4)

	&__main
		margin 0 auto

</style>

